app/Repositories/Gear/GearDataAccessEQRepository.php

select * from `likes` where `likes`.`gear_id` in (2, 4)
select `users`.*, `follow_users`.`user_id` as `pivot_user_id`, `follow_users`.`followed_user_id` as `pivot_followed_user_id`, `follow_users`.`created_at` as `pivot_created_at`, `follow_users`.`updated_at` as `pivot_updated_at` from `users` inner join `follow_users` on `users`.`id` = `follow_users`.`followed_user_id` where `follow_users`.`user_id` in (2, 4)
select count(*) as aggregate from `gears`
---
    public function getAll()
    {
        $gears = Gear::with(['user','likes','followers'])->paginate(3);

select * from `likes` where `likes`.`gear_id` in (16, 39)
select * from `users` where `users`.`id` in (1)
select count(*) as aggregate from `gears` where `user_id` = '1'
---
    public function getUser($user_id)
    {

        return Gear::with(['user','likes'])->where('user_id', $user_id)->orderby('updated_at', 'desc')->paginate(3);

select count(*) as aggregate from `gears` where `gear_category` = 'Kitchen'
---
    public function getCategorizedGear($category)
    {
        return Gear::with(['user','likes'])->where('gear_category', $category)->orderby('updated_at', 'desc')->paginate(3);