app/Http/Controllers/FollowUserController.php

    public function store(Request $request)
    {
        $followedUser = User::findOrFail($request->input('id'));
        FollowUser::firstOrCreate([
//            'user_id' => Auth::id(),
            'user_id' => $request ->user_id,
            'followed_user_id' => $followedUser->id,
        ]);
---
select `users`.*, `follow_users`.`user_id` as `pivot_user_id`, `follow_users`.`followed_user_id` as `pivot_followed_user_id`, `follow_users`.`created_at` as `pivot_created_at`, `follow_users`.`updated_at` as `pivot_updated_at` from `users` inner join `follow_users` on `users`.`id` = `follow_users`.`followed_user_id` where `follow_users`.`user_id` = 1