app/Http/Controllers/GearController.php

select * from `gears` where `gear_category` is null
select count(*) as aggregate from `gears` where `gear_category` is null
---
    public function index(Request $request)
    {
        //RequestはFormrequest使ってはだめ
        $query = Gear::query();


        $search1 = $request->input('category');
        $search2 = $request->input('content');

        if ($request->has('category') && $search1 == ('All')) {
            $gears = DB::table('gears')->paginate(10);
        } else {
            $query->where('gear_category', $search2)->get();

        }


        $gears = $query->orderBy('updated_at', 'desc')->paginate(10);