app/Http/Controllers/GearApiController.php

insert into `gears` (`image_url`, `gear_name`, `maker_name`, `content`, `gear_category`, `updated_at`, `user_id`, `created_at`) values ('https://test-backet-gearlab.s3.ap-northeast-1.amazonaws.com/myprefix/H3wAGdEgwYflie2RGxes4U7IkC6UE9GsBPx217CP.png', 'ss', 's', 'sss', 'BackPack', '2021-01-23 09:19:30', '1', '2021-01-23 09:19:30')
---
            $gear->gear_category = $request->gear_category;

            $gear->user_id = $request->user_id;
            $gear->save();