app/Http/Controllers/LikeController.php

select `gear_id` from `likes` where `user_id` = '1'
select * from `gears` where `id` in (2)
---
    public function index($user_id)
    {
        $user = User::find($user_id);
        $liked_gear_id_list = Like::where('user_id',$user_id)->get(['gear_id']);
        $gear_id_list = [];
        foreach ($liked_gear_id_list as $gear_list){
                   array_push($gear_id_list,$gear_list->gear_id);
        }
        $liked_gear = Gear::whereIn('id', $gear_id_list)->get();